#+TITLE:         Getting started with Jupyter notebooks
#+AUTHOR:        Juliabox team
#+DRAWERS:       sfmb
#+EMAIL:         s.f.m@ieee.org
#+DATE:          08/09/2018
#+DESCRIPTION:   Julia Language tutorials and testing
#+KEYWORDS:      julia, data science, emacs, ESS, org-mode, development
#+LANGUAGE:      en
#+OPTIONS:       H:10 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t d:HIDDEN
#+OPTIONS:       TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:       LaTeX:dvipng
#+INFOJS_OPT:    view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+STYLE: <link rel="stylesheet" type="text/css" href="dft.css"/>

#+LaTeX_CLASS: IEEEtran
#+LATEX_CLASS_OPTIONS: [letterpaper, 9pt, twoside, compsoc, final]
#+LATEX_HEADER: \usepackage[USenglish]{babel}
#+LATEX_HEADER: \hyphenation{do-cu-ment}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{makeidx}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[ttdefault=true]{AnonymousPro}
#+LATEX_HEADER: \renewcommand*\familydefault{\ttdefault} %% Only if the base font of the document is to be typewriter style
#+LATEX_HEADER: \usepackage[libertine,bigdelims]{newtxmath}
#+LATEX_HEADER: \usepackage[cal=boondoxo,bb=boondox,frak=boondox]{mathalfa}
#+LATEX_HEADER: \useosf % change normal text to use proportional oldstyle figures

#+LATEX_HEADER: \markboth{Getting started with Jupyter notebooks}%
#+LATEX_HEADER: {Bizland HUB}
#+LATEX_HEADER: \newcommand{\degC}{$^\circ$C{}}

#+STYLE: <script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script>

# -*- mode: org; -*-
#+OPTIONS:   toc:2
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+BEGIN_ABSTRACT
How to run some cells in org mode.

*Sat Sep  8 17:34:37 CDT 2018*.
#+END_ABSTRACT

* Org-mode documents with Julia
   :PROPERTIES:
   :CUSTOM_ID: getting-started-with-org-mode-julia
   :END:

** Running a cell
    :PROPERTIES:
    :CUSTOM_ID: running-a-cell
    :END:

To execute code within a cell, ~C-c C-c~ above.

#+begin_src julia :session :results output :exports all
  1 + 1
  2 + 2
#+end_src

#+RESULTS:
: 2
: 4

If you're new to org-mode, note that only the last line of a
cell prints by default when you execute that cell and that you can
suppress this output with a semicolon

#+begin_src julia :session :results output :exports all
  1 + 1
  2 + 2;
#+end_src

#+RESULTS:
: 2

** How to get docs for Julia functions
    :PROPERTIES:
    :CUSTOM_ID: how-to-get-docs-for-julia-functions
    :END:

To get docs for a function you're not familiar with, precede it with a
question mark. (This works better at the REPL too!)

#+BEGIN_EXAMPLE
  ?println
#+END_EXAMPLE

** How to use shell commands
    :PROPERTIES:
    :CUSTOM_ID: how-to-use-shell-commands
    :END:

Type =;= and then you can use shell commands. For example,

#+BEGIN_EXAMPLE
  ;ls
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  ;pwd
#+END_EXAMPLE

Shell commands also work at the REPL!

/EOF/
